import logging
from langgraph.constants import END
from utils.graph_utils import SimpleGraphBuilder
from utils.llm_util import CustomLLM, generate_token, AIMessageParser
from typing import TypedDict, List, Dict, Any

logger = logging.getLogger()
logger.setLevel(logging.INFO)


class TextRebuildState(TypedDict):
    input_text: str
    raw_output: str
    json_output: Dict[str, Any]
    error: str


class TextRebuildAgent:
    def __init__(self, text_key, model, tools=None, prompt=None):
        if tools is None:
            tools = []
        self.text_key = text_key
        self.model = model
        self.parser = AIMessageParser()
        self.tools = tools
        self.prompt = prompt if prompt is not None else """根据文本以及坐标，把文本列表整理成正确的语序，使得语句通顺，结果按json列表输出。输出示例：[{"text": "", "source_id": ["", ""]}, ]。\n输入：\n"""


        super().__init__()

    def call_llm_node(self, state: TextRebuildState):
        """调用大模型并获取原始输出"""
        try:
            prompt = f"{self.prompt}{state['input_text']}\n输出: "
            print(f"prompt: {prompt}\n")
            raw_response = self.model.invoke(f"{prompt}")
            print(f"raw_response {raw_response}\n")

            content = None
            content_key = "content"
            if hasattr(raw_response, content_key):
                content = getattr(raw_response, content_key)
            elif isinstance(raw_response, dict) and content_key in raw_response:
                content = raw_response[content_key]

            state["raw_output"] = content
            state["json_output"] = {"ai_message": self.parser.parse_ai_message(raw_response)}
        except Exception as e:
            state["json_output"] = {}
            # state["error"] = f"模型调用失败: {str(e)}"
        return state

    def run(self, request):
        llm_res = self.call_llm_node(request)
        print(f"llm_res {llm_res}\n")
        return llm_res





if __name__ == '__main__':
    llm = CustomLLM(
        api_url="https://copilot.glodon.com/api/cvforce/aishop/v1/chat/completions",
        access_token=generate_token(api_key="TBDDAGJzAXaX5Zzl", api_secret="LEucuSDPRYCUaLj0UX1vvhoA"),
        # model_name="Aejvnm7q3qmko",  # r1
        model_name = "Awd7m0gtxfphu", # v3
        temperature=0.3,  # 确定性输出
        max_tokens=8000  # 减少token消耗
    )
    # print(llm.invoke("你是谁？"))
    agent_client = TextRebuildAgent(text_key="input_text", model=llm)

    res = agent_client.run({"input_text": "[{\"id\": \"15625\", \"x\": \"335.315\", \"y\": \"3002.99\", \"text\": \"11.6  填充墙维护墙防开裂措施;\"},{\"id\": \"15686\", \"x\": \"335.315\", \"y\": \"1597.79\", \"text\": \"10.4  砌体上的门窗过梁,不得采用钢筋砖过梁,预制过梁根据其净跨和墙厚按表10.1《预制钢筋混凝土过梁表》选用,洞口紧靠柱时,\"},{\"id\": \"15631\", \"x\": \"435.196\", \"y\": \"3388.17\", \"text\": \"4) 砌块隔墙与钢筋混凝土构件连接处应设钢丝网于抹灰层内,钢丝网宽度:交界处两边均应≥150。\"},{\"id\": \"18167\", \"x\": \"434.719\", \"y\": \"1348.14\", \"text\": \"  南15G701-1、3要求设置构造柱;填充内墙体较长时,按照间距不大于4米的要求设置构造柱;带构造柱的填充墙应该先砌\"},{\"id\": \"16944\", \"x\": \"428.759\", \"y\": \"2104.23\", \"text\": \"膨胀率应0.02%(特殊注明者外);\"},{\"id\": \"15607\", \"x\": \"435.196\", \"y\": \"834.561\", \"text\": \"2) 设备管井(除风井外)待管道安装完毕后按图9.22封板,板厚及配筋见平面(未注明者按板厚100mm,双层双向配筋C8@\"},{\"id\": \"15628\", \"x\": \"435.196\", \"y\": \"3195.58\", \"text\": \"2) 所有外窗框的上方,均应牢固的锚固于钢筋混凝土梁板内;窗洞周边有构造柱或圈梁时,亦应与构造柱或圈梁锚固;\"},{\"id\": \"15608\", \"x\": \"435.196\", \"y\": \"898.758\", \"text\": \"200,施工中应预留管井板钢筋。\"},{\"id\": \"15605\", \"x\": \"435.196\", \"y\": \"641.97\", \"text\": \"1) 当孔洞D≤300(圆洞)或≤300X300(方洞)、矩形洞长边b≤300时,洞边不另设加强筋,洞口处的受力筋绕过洞口位置\"},{\"id\": \"16938\", \"x\": \"428.83\", \"y\": \"3580.76\", \"text\": \"JGJ8-2016 执规行,当建筑发生不正常或过大沉降、裂缝时,应及时通知设计单位,并增加观测的次数。\"},{\"id\": \"15681\", \"x\": \"435.196\", \"y\": \"770.364\", \"text\": \"见图9.20、图9.21;\"},{\"id\": \"18130\", \"x\": \"491.145\", \"y\": \"385.182\", \"text\": \"留洞口位置不能满足上述要求,须及时提前通知设计单位,核实后方可施工.\"},{\"id\": \"15620\", \"x\": \"278.24\", \"y\": \"1983.84\", \"text\": \"11.  防开裂技术措施\"},{\"id\": \"16963\", \"x\": \"428.759\", \"y\": \"2682.01\", \"text\": \"经设计人员认可后,方能进行施工;\"},{\"id\": \"15636\", \"x\": \"335.315\", \"y\": \"3837.55\", \"text\": \"13.3  电梯门洞边的预留孔洞、机房楼板、检修吊钩等,需待电梯定货后,经核实无误后方能施工;\"},{\"id\": \"16962\", \"x\": \"335.315\", \"y\": \"2617.81\", \"text\": \"11.4  微膨胀剂的掺量,应根据限制膨胀率试验确定;并经有资质的单位检验合格后方可使用;在浇筑混凝土前有关试配报告必须满足设计要求,\"},{\"id\": \"18168\", \"x\": \"434.18\", \"y\": \"1412.33\", \"text\": \"  墙再浇筑构造柱。\"},{\"id\": \"15616\", \"x\": \"335.315\", \"y\": \"1469.4\", \"text\": \"10.3  当墙高超过4.0m时,在墙高的一半处或洞口上方设一道沿墙长的钢筋混凝土卧梁;卧梁截面为墙厚X120,纵筋4A10、箍筋\"},{\"id\": \"15637\", \"x\": \"335.315\", \"y\": \"3901.75\", \"text\": \"13.4  当电梯井道采用空心砖砌筑时,四角设构造柱,井道周边设圈梁,截面为墙厚X300(高)上下各配2C12纵筋,A6.5@200箍筋;\"},{\"id\": \"18169\", \"x\": \"335.315\", \"y\": \"4030.14\", \"text\": \"13.5 电梯机房吊钩按13.1执行。\"},{\"id\": \"15614\", \"x\": \"335.294\", \"y\": \"1283.94\", \"text\": \"10.2  构造柱的做法详图10.1,构造柱的断面、配筋详结构分项说明,填充墙内外墙交接处、外墙转折处、和大于2m窗洞、飘窗两侧按西\"},{\"id\": \"15624\", \"x\": \"513.393\", \"y\": \"2954.09\", \"text\": \"钢筋直径及间距\"},{\"id\": \"15630\", \"x\": \"435.196\", \"y\": \"3323.98\", \"text\": \"筋埋入砌体内500,伸出砌体外500;\"},{\"id\": \"17921\", \"x\": \"962.726\", \"y\": \"2949.83\", \"text\": \"C6@200\"},{\"id\": \"15604\", \"x\": \"335.315\", \"y\": \"577.773\", \"text\": \"9.6.3  板预留孔洞的构造;\"},{\"id\": \"18132\", \"x\": \"416.477\", \"y\": \"1918.78\", \"text\": \"       砂浆面层厚度不小于30mm。\"},{\"id\": \"15680\", \"x\": \"491.145\", \"y\": \"320.985\", \"text\": \"具体设计中未说明做法时,洞的位置应在梁跨中1/3范围,梁高的中间1/3范围内,洞边及洞上下的配筋见图9.19.若施工中现场预\"},{\"id\": \"15606\", \"x\": \"435.196\", \"y\": \"706.167\", \"text\": \"\"},{\"id\": \"15617\", \"x\": \"435.196\", \"y\": \"1533.59\", \"text\": \"A6.5@200,混凝土强度等级C20,纵筋伸入柱内300;纵筋可在浇筑柱前预埋短筋,砌筑时接长;\"},{\"id\": \"15666\", \"x\": \"335.315\", \"y\": \"192.591\", \"text\": \"9.6.2  梁预留孔洞的构造\"},{\"id\": \"15668\", \"x\": \"435.196\", \"y\": \"449.379\", \"text\": \"2) 当小管孔沿梁跨方向排列时:管中心距沿梁跨方向应大于3倍孔径;\"},{\"id\": \"17915\", \"x\": \"335.315\", \"y\": \"2553.61\", \"text\": \"11.3  膨胀加强带:连续式、间歇式或后浇式膨胀加强带混凝土,限制膨胀率≥0.025%; \"},{\"id\": \"15621\", \"x\": \"335.315\", \"y\": \"2746.2\", \"text\": \"11.5  为控制温度应力,屋面板非双层双向配筋时,在无负筋范围按下表双向增设温度应力钢筋,钢筋网两端与板负筋按受拉搭接;\"},{\"id\": \"15684\", \"x\": \"435.196\", \"y\": \"4158.54\", \"text\": \"≤2.5kN/m 2 ,施工期间要严格控制楼面上的荷载,防止超载;\"},{\"id\": \"16958\", \"x\": \"428.759\", \"y\": \"2296.82\", \"text\": \"1) 后浇带位置见结构平面图.后浇带大样详见图11.1;\"},{\"id\": \"15626\", \"x\": \"435.196\", \"y\": \"3067.19\", \"text\": \"1) 砌体与钢筋混凝土墙柱交接处应灌满砂浆充填密实 ,填充墙砌至梁底、板底时,应留一定的空隙,砌筑完应至少隔14天后方可\"},{\"id\": \"15622\", \"x\": \"795.56\", \"y\": \"2824.67\", \"text\": \"现浇钢筋混凝土板温度应力配筋表\"},{\"id\": \"17917\", \"x\": \"1419.57\", \"y\": \"2888.66\", \"text\": \"120~150\"},{\"id\": \"17918\", \"x\": \"1420.27\", \"y\": \"2949.83\", \"text\": \"C8@200\"},{\"id\": \"16960\", \"x\": \"428.759\", \"y\": \"2425.22\", \"text\": \"高一强度等级的微膨胀混凝土(混凝土中掺入砼膨胀剂ZY,限制膨胀率0.025%)封闭.封浇前必须将两侧的浆膜清理干净,不密实的混\"},{\"id\": \"15682\", \"x\": \"335.315\", \"y\": \"4094.34\", \"text\": \"13.6 各楼层的悬挑构件在混凝土浇灌完后其强度必须达到100%、其余构件达到70%后方可拆除支撑及底模,并且构件施工荷载应\"},{\"id\": \"15613\", \"x\": \"429.409\", \"y\": \"1219.74\", \"text\": \" 拉墙筋宜沿墙全长贯通;填充墙长大于5m时,墙顶与梁宜有拉结。\"},{\"id\": \"16945\", \"x\": \"428.759\", \"y\": \"2168.43\", \"text\": \"浇筑混凝土前有关试配报告必须满足设计要求,经设计人员认可后,方能进行施工;\"},{\"id\": \"15615\", \"x\": \"435.196\", \"y\": \"1661.99\", \"text\": \"应做成现浇过梁,过梁应与柱现浇,此时过梁上部纵筋配筋同下部纵筋,且纵筋锚入柱内35d;\"},{\"id\": \"15612\", \"x\": \"335.315\", \"y\": \"1155.55\", \"text\": \"10.1  填充墙应与剪力墙、框架柱(或构造柱)可靠拉接,填充墙应沿剪力墙、框架柱(或构造柱)全高每隔500~600mm设2A6.5拉墙筋,\"},{\"id\": \"16959\", \"x\": \"428.759\", \"y\": \"2361.02\", \"text\": \"2) 施工期间应将后浇带两侧之构件妥为支撑,以确保构件和结构整体在施工阶段的承载能力和稳定性.待两侧混凝土浇筑28天后,采用\"},{\"id\": \"15638\", \"x\": \"435.196\", \"y\": \"3965.95\", \"text\": \"圈梁沿竖向间距一般不大于1.8m,具体详电梯土建安装样本,当圈梁与楼层梁重合时取消圈梁;\"},{\"id\": \"16961\", \"x\": \"428.759\", \"y\": \"2489.42\", \"text\": \"凝土应打去.将后浇带内的浮渣与杂物清除,用水冲洗后,混凝土表面应用纯水泥浆刷浆;\"},{\"id\": \"15629\", \"x\": \"435.196\", \"y\": \"3259.78\", \"text\": \"3) 砌体与砌体交接处应同步错缝砌筑,未能同步砌筑的砌体应留斜槎不留马牙槎,否则应参照钢筋混凝土构件预留墙体拉结筋。拉结\"},{\"id\": \"16943\", \"x\": \"335.167\", \"y\": \"2040.04\", \"text\": \"11.1  室外地面以下(地下室底板、侧壁、地下室顶板、顶板等)、商业屋面、主楼大屋面结构中应加入混凝土微膨胀剂 ZY,混凝土限制\"},{\"id\": \"15669\", \"x\": \"435.196\", \"y\": \"513.576\", \"text\": \"3) 当梁内腰筋或水平筋被套管切断时,应在套管上下另加补充筋,其配筋量同切断筋,并与被切断筋交搭≥1.2LaE;\"},{\"id\": \"16937\", \"x\": \"428.731\", \"y\": \"3516.57\", \"text\": \"本工程在施工和使用期间应进行变形测量(含沉降观测、水平位移观测、倾斜观测等),变形测量具体要求按照《建筑变形测量规范》\"},{\"id\": \"15627\", \"x\": \"489.158\", \"y\": \"3131.39\", \"text\": \"补砌挤紧,起头收尾均应用预制混凝土块抵紧;\"},{\"id\": \"15609\", \"x\": \"335.315\", \"y\": \"962.955\", \"text\": \"9.7  预埋件\"},{\"id\": \"17920\", \"x\": \"968.647\", \"y\": \"2888.66\", \"text\": \" 60~110\"},{\"id\": \"15538\", \"x\": \"435.196\", \"y\": \"128.394\", \"text\": \"2) 剪力墙上小洞口加强筋(除结构图中注明者外),应按16G101-1图集第83页处理;\"},{\"id\": \"15623\", \"x\": \"540.896\", \"y\": \"2889.48\", \"text\": \"板厚(mm)\"},{\"id\": \"15634\", \"x\": \"335.315\", \"y\": \"3709.16\", \"text\": \"13.1  柱、梁内作为防雷接地的主筋,应按电施防雷要求绑扎搭接连通,确保防雷效果。\"},{\"id\": \"15618\", \"x\": \"335.315\", \"y\": \"1726.19\", \"text\": \"10.5  女儿墙构造详西南15G701-3第41页;\"},{\"id\": \"15635\", \"x\": \"335.315\", \"y\": \"3773.36\", \"text\": \"13.2  电梯定货必须符合本图所提供的电梯井道尺寸、门洞尺寸以及建筑图纸的电梯机房设计;\"},{\"id\": \"15619\", \"x\": \"335.315\", \"y\": \"1790.38\", \"text\": \"10.6  剪力墙(柱)边≤200mm的门垛采用混凝土浇筑,做法见图10.2。\"},{\"id\": \"15611\", \"x\": \"278.24\", \"y\": \"1092.01\", \"text\": \"10.  填充墙(质量控制等级按B级)\"},{\"id\": \"16957\", \"x\": \"335.315\", \"y\": \"2232.63\", \"text\": \"11.2  后浇带:\"},{\"id\": \"17916\", \"x\": \"335.315\", \"y\": \"1854.58\", \"text\": \"10.7  楼梯间和人行通道的填充墙,应采用钢丝网砂浆面层加强。面层应双面设置直径不小于4mm,间距不大于150mm的钢筋网,\"},{\"id\": \"15610\", \"x\": \"410.226\", \"y\": \"1027.15\", \"text\": \"所有钢筋混凝土构件上的预埋件,各工种应配合土建施工进行预留预埋严禁事后补埋;预埋件应与钢筋绑扎固定,不得与钢筋焊接。\"},{\"id\": \"15667\", \"x\": \"435.196\", \"y\": \"256.788\", \"text\": \"\"},{\"id\": \"15632\", \"x\": \"278.24\", \"y\": \"3652.09\", \"text\": \"13.  其他说明\"},{\"id\": \"15767\", \"x\": \"278.24\", \"y\": \"3459.84\", \"text\": \"12.  变形测量\"}]"})
    print(f"res {res} type {type(res)}")